app/views/books/index.json.jbuilder

  json.updated_at book.updated_at.to_i
  json.words_count book.words.size
---
SELECT COUNT(*) FROM "words" INNER JOIN "books_words" ON "words"."id" = "books_words"."word_id" WHERE "books_words"."book_id" = $1  [["book_id", 980190962]]