app/controllers/books_controller.rb

  def index
    @books = ::Book.includes(:words).order(updated_at: :DESC).page(params[:page] || 1)
---
SELECT  "books".* FROM "books" ORDER BY "books"."updated_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "words".* FROM "words" WHERE "words"."id" IN (1000562403, 268784245, 909751057)
SELECT COUNT(*) FROM "words" INNER JOIN "books_words" ON "words"."id" = "books_words"."word_id" WHERE "books_words"."book_id" = $1  [["book_id", 980190962]]