app/controllers/learn_notes_controller.rb

  def create
    @learned = current_user.learn_notes.find_or_initialize_by(word_id: params[:word_id])
    @learned.status = params[:status]
    @learned.save!
---
SELECT  "learn_notes".* FROM "learn_notes" WHERE "learn_notes"."user_id" = $1 AND "learn_notes"."word_id" = $2 LIMIT $3  [["user_id", 980190962], ["word_id", 1000562403], ["LIMIT", 1]]
UPDATE "learn_notes" SET "status" = $1, "updated_at" = $2 WHERE "learn_notes"."id" = $3  [["status", 1], ["updated_at", "2020-02-07 00:55:32.406451"], ["id", 524266083]]