app/controllers/notebooks_controller.rb

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."user_id" = $1 ORDER BY "notebooks"."updated_at" DESC LIMIT $2 OFFSET $3  [["user_id", 980190962], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "words".* FROM "words" WHERE "words"."id" IN (1000562403, 268784245)
---
  def index
    @note_words = current_user.notebooks.includes(:word).order(updated_at: :DESC).page(1 || params[:page])

INSERT INTO "notebooks" ("status", "user_id", "word_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["user_id", 980190962], ["word_id", 1000562403], ["created_at", "2020-02-06 23:50:02.352159"], ["updated_at", "2020-02-06 23:50:02.352159"]]
---
  def create
    @new_word = ::Notebook.create!(word_id: params[:word_id],
                                    user: current_user,
                                    status: 'actived')

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."user_id" = $1 AND "notebooks"."id" = $2 LIMIT $3  [["user_id", 980190962], ["id", 1000562403], ["LIMIT", 1]]
---
  def destroy
    @note_word = current_user.notebooks.find(params[:id])