app/controllers/sessions_controller.rb

  def create
    login_params = params.require(:user).permit(:username, :password)
    @user = User.find_by('lower(username) = lower(?) AND password = ?', login_params[:username], login_params[:password])
---
SELECT  "users".* FROM "users" WHERE (lower(username) = lower('name1') AND password = 'pwd12345') LIMIT $1  [["LIMIT", 1]]