app/controllers/words_controller.rb

SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1000562403], ["LIMIT", 1]]
---
  def show
    @word = Word.find(params[:id])